'''
Задача 3

Вывести сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
'''

n = 0
for i in range(1, 101):
    n += i

print('Сумма ряда чисел от 1 до 100 равна', n)